# -*- coding: utf-8 -*-
duty_dict={
'图像算法工程师':
'岗位职责：\n1.负责机器学习及图形图像等相关场景的研发工作；\n2.负责数据采集、清洗、汇总、集成等数据相关的流程工作；\n3.负责对公司平台的数据进行整理、挖掘及分析工作；\n4.基于现有产品实现，提出可扩展，高性能，高可用性设计方案；\n任职资格：\n1.熟悉python、java、shell语言编程(熟悉c/c++属于加分项)；\n2.熟悉Hadoop、Spark大数据处理工具和技术，有两年以上的实际大数据处理经验；\n3.熟悉计算机视觉、图片识别、图像分类、目标检测、图像分割、图片解析等相关技术；\n4.对常用机器学习算法，对CNN、RNN、Fast-rcnn等深度学习算法有了解，对成熟的模型，例如：VGG、AlexNet等有了解；\n5.能够独立完成模型的构建与训练,对深度学习框架tensorflow、keras、Caffe有了解；\n6.对开源的图片处理库opencv、libpng、scikit-image等有了解\n7.责任心强，工作踏实，团队协作精神',

'算法工程师':
'工作职责：\n为内容消费类产品，提供算法支持，包括:\n1. 分布式机器学习推荐算法的开发和调优\n2. 针对大规模数据，进行数据清洗，特征挖掘和统计分析\n3. 针对信息流推荐、主题推荐等不同应用场景的特定推荐算法开发及调优\n4. 用户兴趣模型的开发和调优\n任职要求：\n1. 熟练使用常用机器学习算法，有1年以上相关项目开发经验。熟悉深度学习算法者优先\n2. 有信息流、个性化推荐、情感分析等算法项目经验者优先\n3. 熟练使用hadoop或spark计算平台，具有1年以上大规模数据并行计算经验\n4. 精通至少一门编程语言，熟练使用scala、java者优先\n5. 熟练使用至少一种机器学习算法工具包，熟练使用mllib者优先\n6. 熟练使用hive和mys\n7. 工作态度认真积极，目标导向型优先',

'机器学习算法工程师':
'工作职责:\n1.能够使用机器学习算法有效的挖掘海量数据并从中发现规律或者建立模型提供商业决策\n2.对业务数据，用户数据，行为数据进行深度挖掘分析，发现数据背后的规律，完成对用户画像，营销以及风险控制的建模\n3.利用数据挖掘，机器学习，以及自然语言处理等相关算法，解决业务需求，提高产品用户体验，提升转换率\n4.负责机器学习建模和效果优化，负责个性化推荐算法设计和效果优化\n任职资格:\n1.硕士以上学历，计算机、大数据、金融、经济学相关等专业\n2.3年以上算法分析相关经验，熟练使用SQL、R、Python等进行数据分析、数据挖掘\n3.熟悉机器学习常用算法，有搜索、广告、推荐系统经验者优先\n4.优秀的分析问题和解决问题能力，对解决挑战性的问题充满激情\n5.熟悉Hadoop/HBase/Hive/Storm/Spark/Kafka分布式大数据处理系统者优先',

'深度学习算法工程师':
'岗位职责：\n1、从事深度学习领域的算法模型研究工作，\n2、负责视频、图像相关项目深度学习模型的开发和部署。\n3、负责单位深度学习模型成果沉淀和产品转化。\n岗位要求：\n1、有良好的数学基础；\n2、从事过深度学习视觉方面的研究或有深度学习视觉项目相关经验；\n3、熟悉深度学习算法，特别是CNN和RNN；\n4、能熟练运用 tensorflow、PyTorch、Keras、Caffe 其中一种框架进行深度学习模型训练和开发；\n5、具有良好的团队合作精神。',

'视觉设计师':
'岗位职责\n1. 负责政务类移动端业务体验设计支持，及运营推广相关设计。\n2. 参与设计体验、流程的制定和规范；\n3. 参与整个设计过程中的评审，负责视觉实现的检查，监督产品视觉的实现质量；\n4. 关注用户反馈与沟通，根据分析结果持续优化设计；\n5. 参与分享设计经验，提高团队的设计能力。\n岗位要求\n1. 从事设计行业工作 3 年以上\n2. 热爱设计，拥有宽广的行业（平面设计、互联网、手持应用）视野与时尚的审美标准\n3. 对网站设计有丰富经验，有成功案例（有桌面、移动端多平台案例者更佳）\n4. 有丰富的设计理论知识和对流行趋势敏锐的洞察力，推动改善提升团队的设计能力\n5. 对用户研究有一定经验和见解\n6. 善于沟通，具备良好合作态度团队精神，富有工作激情、创造力和责任感，有不断学习的良好习惯，能承受高强度的工作压力\n7. 美术、设计或相关专业本科以上学历，手绘原创能力较强或具备一定交互设计能力可优先考虑',

'NLP算法工程师':
'岗位职责:\n1. 运用前沿深度学习和机器学习相关技术优化机器翻译、语义理解等模型\n2. 机器翻译引擎的设计及研发\n3. 句法分析、语义分析等自然语言处理相关算法的研发\n4. 对应用部门提出的引擎性能需求提供解决方案，进行效果调优\n岗位要求:\n1. 计算机相关专业毕业，硕士以上学历优先，英语或日语良好\n2. 熟悉自然语言处理，机器学习，深度学习等常用算法，能够跟踪NLP领域的最新研究方向\n3. 有相关工作经历或实验室背景，包括但不限于以下方向：机器翻译、智能对话、知识图谱等\n4. 熟悉Linux开发环境，较强的C/C++编程和算法基础，熟练使用Python、shell等脚本语言\n5.良好的团队合作精神，较强的沟通能力',

'.net开发工程师':
'岗位职责：\n1、负责asp.net软件产品的设计、编码和单元测试工作；\n2、负责现有asp.net软件产品的维护、完善及优化；\n3、负责部分研发过程中的文档编写工作；\n4、参与开发过程中的需求分析工作；\n5、与测试和需求等人员沟通并合作。\n任职要求：\n1、2年以上Web开发经验，3年以上ASP.NET开发经验；\n2、精通CSS、html、Javascript、Ajax、jquery等技术，熟练使用div+css布局；\n3、移动端web页面产品研发、优化和维护；\n4、熟悉网络开发三层架构，熟悉ASP.NET、C#开发技术；\n5、了解CS、BS开发架构和设计模式，具有面向对象编程思想；\n6、熟练使用PS等画图切图工具，能够自我完成图片切图的优先；\n7、熟练掌握SQL Server关系型数据库和T-SQL语言的优先。',

'C#开发工程师':
'岗位职责：\n1、参与项目需求分析,进行系统框架和核心模块的详细设计；\n2、根据公司技术文档规范编写相应的技术文档；\n3、根据新产品开发进度和任务分配，开发相应的软件模块；\n4、研究项目技术细节，编写相应的说明书；\n5、根据需要不断修改完善软件，软件的后期维护、更新。\n任职要求：\n1、熟练使用C#开发语言，2年以上web软件开发工作经验，有良好的编程习惯，熟练应用mvc框架、WCF框架；\n2、熟悉 VS、SqlServer 开发环境；\n3、熟悉.NET(C#)开发语言.NET编程工具；\n4、精通HTML\n5、CSS\n3、Javascript；熟练使用前端组件jQuery, Bootstrap等；掌握JSON数据处理；\n5、熟悉软件开发流程、设计模式、体系结构；\n6、熟悉webapi开发；\n7、良好的沟通、协调以及较强自学能力，逻辑思维能力强，有较强的条理性和判断力，具备强烈的责任感及执行力。',

'C++开发工程师':
'岗位职责：\n1、负责软件设计和开发工作；\n2、负责产品的功能优化、性能优化及技术调研工作；\n3、产品相关文档说明；\n4、完成上级交办的其他工作。\n任职要求：\n1、本科及以上学历；计算机相关专业；\n2、会使用simulink接口转换，有开发动态库的经验。了解混合编程，UDP通信；\n3、精通c++开发语言，熟练掌握git.make等开发工具，熟悉socket编程。',

'全栈工程师':
'工作描述：\n1、 评审产品需求，参与分析与制定前后端技术实施方案；\n2、 负责系统设计、核心模块的代码编写；\n3、 参与系统和核心模块的测试验证；\n4、 参与系统的部署和运维；\n5、负责相关技术文档的编写;\n任职要求：\n1、 本科及以上学历，计算机或相关专业；3年以上软件开发设计经验，有互联网应用设计和开发经验者；\n2、精通XHTML/XML、CSS，熟悉页面架构和布局，对表现与数据分离、Web语义化等有深刻理解，熟练使用HTML5/CSS3等技术；\n3、精通JavaScript、Ajax、DOM等前端技术，掌握面向对象编程思想，对前端常用框架jquery、Vue、Bootstrap有开发经验；\n4、对css/JavaScript性能优化、解决多浏览器兼容性问题有一定的经验；\n5、对常用的xml、json数据格式有一定理解，了解http协议，熟悉常用网络请求类型及其使用场景；\n6、熟练使用java进行开发，了解JVM原理者优先，能够对已有的代码进行优化，对SpringCloud、Spring Boot、jesry等后端开发框架有深入的了解，对python具有一定开发能力优先；\n7、 熟练掌握数据库，mysql、hbase、mongodb至少一种，对sql语句优化有一定经验的优先；\n8、对redis、kafka、rabbitmq等常用中间件有所研究，了解其基本原理以及使用场景；\n9、对docker等容器技术有一定了解，对jenkins持续集成工具有一定了解；\n10、熟练使用常用的应用服务器，例如：Tomcat、Jetty，了解nginx者优先。',

'后端开发工程师':
'岗位职责：\n1、负责公司后端服务开发及维护\n2、负责设计开发后端框架\n3、负责运营维护公司线上产品 \n任职要求：\n1、有1-3年的服务器开发经验；\n2、熟悉linux，精通python, node.js, C, C++, golang中至少一种编程语言，较好的独立开发能力\n3、熟悉网络编程，有Docker开发、维护经验优先\n4、学习能力强，能快速适应各种环境下的开发工作\n5、强烈的责任心，具有团队精神和创新精神，诚实可靠',

'Golang开发工程师':
'岗位职责：\n1、负责公司移动应用服务端的设计和开发；\n2、负责公司物联网设备云端服务的开发和优化；\n3、参与公司物联网平台的架构设计和开发工作；\n4、探索新技术，帮助业务达成目标；\n任职要求：\n1、计算机或相关专业本科及以上学历；\n2、熟悉Go语言，有两年以上Web相关开发工作经验优先。热爱编程，扎实的编程能力，良好的数据结构和算法功底；\n3、熟悉linux，熟悉常用数据结构和算法，基础扎实，有较强的coding能力；\n4、 有较强的分析问题解决问题能力。\n5、有基于Go大中型项目开发经验优先，有项目完整生命周期经历优先，有一线互联网公司工作经历优先；',

'Java开发工程师':
'岗位职责：\n1、按照详细的设计，完成基础性的代码设计、代码编写;\n2、对自行编制完成的基础性代码进行调试及测试;\n3、修复测试发现代码缺陷，确保质量;\n4、按照详细设计流程、计划，定时完成工作;\n5、辅助进行文档资料整理、收集资料;\n6、公司安排的其他事宜等。\n任职要求：\n1、本科及以上学历，计算机相关专业毕业，5年以上JAVA开发经验；\n2、熟练使用 JAVA、XML、JavaScript等主流高级程序设计语言，对Java知识深入掌握；\n3、熟练使用数据库（mysql，sqlserver，oracle等）中的一种或者多种等主流数据库产品；\n4、熟悉Spring/Springboot/SpringCloud，Mybaits、Redis等框架；\n5、熟悉解常用应用服务器产品，如Weblogic Server、Tomcat；\n6、熟悉常用的设计模式；\n7、熟悉常用的数据结构与算法；\n8、有较好的自驱能力、自学能力和团队合作精神；',

'PHP开发工程师':
'岗位职责：\n1、 负责公司项目后端功能的研发，根据公司发展规划，完成平台后端功能设计及优化;\n2、 参与项目沟通对接等工作；\n3、 独立或者分组进行针对项目需求的功能开发和优化；\n4、 拥有良好的代码习惯，要求结构清晰，命名规范，逻辑性强，代码冗余率低；\n5、 根据项目开发进度和任务分配，开发相应的应用模块。岗位要求：\n1、 具有MySQL索引优化、查询优化和存储优化经验、PHP缓存技术、静态化设计方面的经验，要求随时随地贯彻优化开发的思想，所负责的项目须能承担繁重的访问压力;\n2、 精通PHPMySQL开发，精通memcache、redis等缓存技术者优先;\n3、 有大流量并发网站工作经验，有创新思维并勇于挑战新事物;\n4、熟悉掌握HTML、JS 、CSS 等前端技术 ;\n5、具备良好的编程习惯，熟练掌握OOP编程和常见设计模式 ;',

'Python开发工程师':
'工作职责：\n1、负责大数据相关产品及项目的算法策略设计、开发、改进和封装；\n2、负责应用创新和前沿技术的跟踪、研发和算法工程化；\n任职要求：\n1、3年以上相关工作工作经验；\n2、计算机或数学相关专业硕士及以上学历，机器学习、数据挖掘方向优先；\n3、扎实的Python编程基础，具有良好的代码风格；\n4、有基于hadoop体系的数据仓库开发经验，了解Hive，Hbase，Spark，等大数据处理工具；\n5、具备较强的学习能力和责任心，良好的沟通能力、文档编写能力。',

'数据挖掘工程师':
'岗位职责：\n1、基于数千万wps用户数据，建立对用户和对内容的深入理解；\n2、基于 Hadoop高性能计算平台，构建和改进数据挖掘和机器学习算法与技术，支撑知乎的业务发展；\n3、以数据挖掘和数据分析为基础，发现新的产品改进点，以数据和技术驱动知乎的产品改进，探索新的产品形态；\n4、跟踪业界最新的机器学习算法和研究趋势，并尝试将其应用于实际的生产环境；\n5、爬取站外第三方数据，补全公司数据体系。任职资格：\n1、3年以上数据挖掘经验，扎实的计算机基本功，对计算机算法有深入的理解；\n2、熟练掌握 C++、Python、Java 等其中的一种或几种编程语言，参与过实际工程项目，理解基本的编程模式；\n3、使用过 Hadoop、Spark、MPI 等并行计算平台中的一种或几种，对并行化计算有较深入的认识和理解；\n4、理解常用的机器学习和数据挖掘算法，并进行过相关的实践。\n5、有互联网金融数据经验优先',

'推荐算法工程师':
'岗位职责：\n1、 交互引擎，技能功能开发，包括意图、事件的响应等；2 、负责交互引擎技能个性化推荐策略；3 、用户画像构建；\n4、 数据挖掘：构建特征完备的音频、文本数据。\n任职要求：\n1、熟悉常用的推荐算法，数据挖掘算法，熟悉分类、打标签等算法；\n2、熟悉C/C++/python等语言；\n3、熟悉常见的机器学习算法，有大规模数据处理经验；\n4、优秀的分析和解决问题的能力，有创新意识，良好的沟通能力。',

'DBA':
'岗位职责： \n1、负责数据管理维护及日常监控，保证数据库安全、稳定、高效运行；\n\n3、负责数据库设计方案的审核及实施，性能分析和调优，故障应急处理；\n3、完善当前的数据库运维体系，为公司的数据库服务稳定性负责，为业务提供高可用，高性能的数据库系统服务。\n任职要求：\n1、三年以上DBA经验，熟悉MySQL数据库设计、管理与优化。\n\n3、熟练分析MySQL语句性能，精通MySQL索引、分表等优化措施的设计和实施，并配合开发人员优化数据库访问语句。\n3、熟悉MySQL数据库方面的运维技能:整体数据库规划，主从复制，备份，故障诊断，系统调优，监控报警。\n4、有大型互联网或电商数据库架构规划、分库分表设计等经验。\n5、较强的故障定位和处理能力。\n6、熟悉公有云（AWS、阿里云）服务环境优先。',

'ETL工程师':
'岗位职责：\n1、负责数据仓库的ETL开发及ETL标准化工作；\n\n3、负责数据规范的设计，数据质量管理开发及文档化；\n3、负责元数据管理系统的设计与开发。\n任职要求\n1、211/985院校本科以上学历，计算机，数学等相关专业；\n\n3、熟悉ETL开发流程，有两年以上hadoop和ETL工作经验，熟练使用大数据（hive，spark等等）进行ETL开发；\n3、有良好的文档编纂能力，热爱分享；\n4、有良好的编程基础，能够熟练使用一种计算机语言，如python，Java等。',

'大数据开发工程师':
'岗位职责：\n1、负责大数据平台的开发与维护；\n\n3、参与公司项目需求，方案讨论、设计开发等工作；\n3、参与开发和维护现有项目及新项目的开发，按时完成任务，对代码质量负责；\n4、主动积极发掘、提出和规避项目各个环节可能存在的系统缺陷或项目风险；\n5、参与大数据各模块产品研发，对海量数据进行处理与分析。\n任职要求： \n1、熟悉大数据开源技术，包含（不限于）Hadoop/Spark/Hive/Hbase/Impala /Flume/Kafka/Es分布式框架/计算/存储/检索等相关技术；\n\n3、掌握Java或Python一种开发语言；\n3、熟练操作UNIX/LINUX，熟练使用常用命令，熟练使用shell脚本；\n4、熟练使用SQL，熟练使用至少一种主流关系型数据库；\n5、有大数据可视化分析、数据挖掘、数据治理项目或产品开发经验优先；\n6、具备良好的学习能力、分析能力和解决问题的能力； \n7、有较强的沟通和理解能力，有良好的团队协作精神；',

'数据仓库工程师':
'\n1、负责数据建模, ETL规则设计和数仓开发工作, 包括但不仅限于宽表建模/数据治理/质量监控与优化\n\n3、负责需求调研/分析, 确保数据质量, 实现监控逻辑并持续优化\n3、负责业务模型的抽象以及数据模型设计开发。\n任职要求:\n1、熟悉Java/Python/Shell等至少一种开发语言\n\n3、熟悉Kylin/Presto/Hive，具备海量数据处理和性能调优经验\n3、具备大型(TB 级别)数仓架构设计、模型设计、ETL设计研发的相关经验优先\n4、熟悉数仓基础模型建模理论/方法论/数据库设计理论\n5、有互联网行业数据仓库经验者优先\n6、从事数据仓库领域工作至少2年以上',

'BI工程师':
'岗位职责:\n1、对接业务部门需求，参与报表需求分析、报表设计、数据口径分析等;\n2、配合报表需求，完成相应数据库表的创建与维护;\n3、编写SQL语句,并进行自动化报表的实现;\n4、报表结果数据核对,对数据问题进行跟踪;\n5、负责报表的上线及BI系统的日常维护;\n任职要求:\n1、熟悉一种以上主流报表工具，如网易有数、tableau、FineReport、smartbi等等;\n2、熟悉关系型数据库 (如：MySQL,SQL Server,Oracle等)，熟悉SQL语句;\n3、熟悉linux环境，及定时脚本的布置;\n4、热爱BI开发工作，并有实际BI可视化经验;\n5、具有良好的沟通，踏实，有上进心、责任心;',

'售前工程师':
'岗位职责：\n1、负责工业企业客户交流及售前支持，负责帮助客户和合作伙伴规划清晰的大数据平台产品实施路线和落地方案\n2、负责大数据平台产品售前技术支撑工作，例如解决方案、客户交流、项目投标书编写及讲标，POC测试实施；\n3、负责牵头组织产品交付，例如项目管理、资源协调、风险控制；\n4、负责调研用户需求，将行业内的业务需求转化为数据及模型需求，真实反馈给研发；\n任职要求：\n1、具有大数据项目整体规划、售前咨询、项目管理经验；\n2、熟悉云计算和大数据相关产品和技术，有大数据技术及理论基础；\n3、能编写售前技术方案，制作方案演示稿；',

'实施工程师':
'岗位职责：\n1、负责项目实施工作，包括软件现场安装、项目推进；\n2、及时反馈项目在实施及售后服务过程中的问题及解决的情况、进度，并提出对项目实施及售后服务的改进建议；\n3、与客户沟通，通过专业的项目实施与售后服务保持良好的客户关系。任职要求：\n1、教育背景：全国统招大学本科及以上，计算机或软件相关专业；\n2、2年以上实施经验，有软件、呼叫中心系统类项目实施经验佳；\n3、熟练Linux操作系统，熟悉网络安装系统，熟悉通信系统；\n4、良好的沟通能力、有服务意识，执行力强。',

'售后服务专员':
'岗位职责：\n1、通过电话方式，为合作客户提供专业的网站使用培训，确保客户可以正确的操作平台，并充分利用信息；\n2、对所维护的客户定期进行电话回访，与客户保护良好的沟通，建立持续稳定的合作关系；\n3、深入了解客户的产品及需求，为客户提供更有针对性的服务；\n4、主动挖掘客户在使用过程中遇到的问题，并及时解决；\n5、及时向上级领导反馈工作中遇到的问题，积极主动的寻求解决方案；\n任职要求：\n1、性格开朗，工作认真，责任心强，能够适应快节奏、高效率的工作环境和工作压力；\n2、较强的敬业精神和团队合作精神，具有良好的应变能力和优秀的心理素质；\n3、具有良好的亲和力、语言表达能力和与客户沟通的能力，有较强的时间计划和工作安排能力；\n4、具备优秀的客户服务能力与销售意识，有两年以上的销售或客户服务经验者优先；\n5、熟悉office等办公软件，网络操作熟练。',

'前端开发工程师':
'岗位职责：\n1、负责前端界面的构建，各类交互设计与实现；\n2、各产品线的Web界面维护、易用性改造，模块化设计和性能的优化；\n3、配合后台开发人员完成项目；\n 4、完成领导交办的其它任务。\n任职要求：\n1、本科及以上学历，两年以上Web前端实际开发经验；\n2、精通HTML5、CSS3、AJAX、JSON及W3C标准规范；\n3、熟悉对象化Javascript编程，能够熟练的使用原生js编写代码；\n4、熟悉至少一种前端MVVM框架，并有实际开发经验，如vue/angular/react，熟悉vue的优先。\n5、能够使用至少一种前端自动化构建工具，如webpack、grunt、glup等\n6、了解至少一种后台开发语言，如php/java/node.js等\n7、优化前端代码，验证并修复测试中发现的问题，解决不同的浏览器及不同版本的兼容性问题。',

'硬件工程师':
'岗位职责：\n1、负责产品全生命周期的硬件开发工作，包括撰写设计规格书、详细设计方案、原理图、调试、设计验证、硬件测试以及产品的维护工作。\n任职要求：\n1、电子、通信相关专业，本科及以上学历，2年以上数字电路和模拟电路的开发经验；\n2、熟悉FPGA相关硬件，做过VPX项目开发；\n3、熟悉单片机开发；\n4、熟悉Cadence的原理图和PCB设计软件；\n5、具备EMC、SI的相关知识；\n6、有音视频开发经验，同时有TI、海思等视频处理器开发经验者优先。',

'嵌入式软件工程师':
'岗位职责：\n1、POS终端固件程序的开发和维护；\n2、emv/pboc接触和非接L1认证的过检，安全认证和PCI的过检；\n3、和硬件开发人员、测试人员一起，完成功能开发和内部验证；\n4、POS非接天线的设计和调试，通过非接L1认证电气和协议测试。\n任职要求：\n1、POS终端、读写器、智能卡等行业开发经验；\n2、熟练掌握C语言，熟悉单片机的软硬件开发；\n3、熟悉UART、I2C、SPI等常用外设的开发，熟悉ISO-7816/ISO-14443规范；\n4、对POS非接天线的设计和调试有较丰富的经验；\n5、工作积极主动，主动承担任务，不自我设限，善于快速学习；',

'自动化测试工程师':
'岗位职责：\n1、推动自动化测试环境和流程的建立,并持续优化和维护\n2、推广自动化测试框架的使用，包括接口测试、性能测试、UI测试等\n3、深入分析跟谁学主要业务，制定各个系统的测试方案及测试策略\n4、沟通协调开发、运维等部门，推动自动化测试在CI/CD的集成\n5、通过测试相关流程、策略、方法的创新和测试工具开发，提升自动化测试覆盖率及测试效率，促进团队技术进步。\n任职要求:\n1、精通python语言，熟悉sql ，有接口自动化项目经验；\n2、熟悉Linux操作系统，有性能测试项目经验；\n3、熟悉持续化集成，会使用多种测试工具 ，如appium，JMeter等；\n4、具有较强的业务分析能力，较好的沟通表达和综合协调能力。',


'安全工程师':
'岗位职责： \n1、通过代码审计、逆向分析、工具扫描、人工测试等方法检测应用安全质量； \n2、对发现的安全漏洞进行跟踪，编写代码级的漏洞整改方案，协助修复漏洞并对修复后的漏洞进行验证； \n3、构建及维护安全测试知识资产，形成相关安全测试方法和规范文档，包括但不限于应用安全测试通用案例指引示例、应用安全问题修复建议、安全工具使用手册等； \n4、对相关人员的安全培训，包括但不限于安全知识、安全技术、安全工具使用等的培训。 \n任职要求： \n1、能够分析常见开源系统漏洞，并针对漏洞提供修复方案； \n2、熟悉主流的Web安全工具与攻击技术，如：XSS、文件包含、命令执行等； \n3、熟悉代码审计工具及渗透测试流程，有常见web应用漏洞挖掘经验者优先； \n4、至少掌握一门编程语言go/Python/PHP/Java等； \n5、具有较好的沟通意识，解决问题能力，文档编写能力。',

'技术总监':
'岗位职责：\n1、负责规划公司产品的技术方向和进行技术调研 \n2、负责产品的架构设计与优化，带领技术团队完成产品和项目开发工作 \n3、负责核心模块的开发，推进对重大技术问题进行攻关 \n4、负责研发团队管理和建设工作 。\n任职要求： \n1、大学本科以上学历，计算机相关专业，五年以上互联网公司技术开发经验，至少三年以上管理经验 \n2、有大型高性能分布式系统开发经验；丰富的海量数据处理系统经验，参与或是负责过大规模并发系统的研发工作 \n3、对高质量代码和架构设计有深刻理解，熟练掌握技术开发趋势 \n4、具有优秀的学习能力、技术前瞻性，对前沿技术创新具有敏锐度 \n5、有领导力，富有创业精神，极强的自我驱动能力和沟通能力',

'技术经理':
'岗位职责：\n1、 管理项目研发工作，参与实际开发任务，处理团队的技术问题；\n2、参与技术决策，指导，评审，保证所属项目的开发质量；\n3、关注公司技术体系相关方向上的技术发展，参与完善技术架构的规划；\n4、与公司的架构组协同工作，保障架构方案的实现与落地；\n任职要求：\n1、统招本科，硕士及以上学历，计算机及其相关专业，5年以上开发工作经验，其中至少1年研发管理经验；\n2、精通Java，Go，Python，Javascript等一种以上的Web开发技术；\n3、具有深厚的技术背景、精通软件开发、项目管理、平台后台配置及规划；\n4、对互联网主流开发技术有深入的理解和实际的经验，拥有广阔的技术视野；\n5、具备系统架构设计经验，深入理解SOA架构，对互联网高性能、高负载应用系统架构设计具有丰富的经验，有区块链技术实践经验者更优先；\n6、能站在业务、市场、产品的角度看技术的实现，并理解业务战略的高度和格局；',

'架构师':
'岗位职责：\n1、7年以上Java开发经验，3年以上架构设计经验；\n2、能对分布式常用技术进行合理应用，解决问题；\n3、精通网络编程，熟悉HTTP，TCP/IP协议；\n4、对数据库的基本理论和内部实现机制有深刻的理解，能够熟练应用MySQ、NoSQL，有实际大数据量的数据库设计经验，有分库分表经验；\n5、熟悉缓存技术，网站优化，服务器优化，集群技术处理、网站负载均衡、系统性能调优等软件编程高级技术；\n6、良好的逻辑思维能力，熟悉业务抽象和数据模型设计，具有很强的分析问题和解决问题的能力，对解决具有挑战性问题充满激情；\n7、知识面广，思路开阔，创新能力强，对新技术持有敏感性并愿意致力于新技术的探索和研究。\n任职要求:\n1、业务需求系统分析，提出技术研究及可行性报告；\n2、结合需求设计高扩展性、高性能、安全、稳定、可靠的技术系统 ；\n3、可以通过配置实现业务需求的变化，跟踪并研究最新技术并应用于产品 ；\n4、指导研发工程师的产品开发和技术研究工作，解决各类技术疑难问题，形成良好的研发氛围，提升团队整体技术水平。',


'Android开发工程师':
'岗位职责：\n1、根据项目计划，按时独立完成高质量的软件编码、联调、自测、发版工作；\n2、按时完成客户端软件的维护及更新。\n任职要求：\n1、本科以上学历，计算机相关专业。Java预研基础扎实；\n2、两年以上Android开发经验，熟练使用性能优化相关工具使用，熟悉版本管理工具原理及使用；\n3、熟悉Android系统，熟悉Android软件的开发、测试、分发流程，有良好的自测习惯；\n4、业务思路敏感，可以快速熟悉业务流程，并有铭感的用户思维；\n5、了解HTML5，JS相关技术，熟悉WebView平台适配优化，有网络爬虫经验者优先；\n6、熟悉自定义布局，对性能优化（内存优化、GPU显示优化）有丰富经验优先；\n7、熟练根据产品类别了解用户思维优先；\n8、乐于团队内部分享技术经验；\n9、热爱互联网，对移动产品有浓厚兴趣，工作积极主动，乐观豁达，良好的沟通能力，有强烈的责任感。',

'iOS开发工程师':
'岗位职责：\n1、根据软件设计规范，负责完成iPhone应用功能模块代码的编写；\n2、能够独立思考，优化产品实现方式和代码结构； \n3、编写程序技术文档，根据软件项目的要求，编写符合软件工程规范的技术文档； \n4、配合美术及策划人员能够优化现有产品的用户操作体验；  \n任职要求： \n1、本科及以上学历，计算机、电子或相关专业。 \n2、具有三年以上C/C++ /Objective-C/Swift开发经验，对OOD/OOP有深刻的理解； \n3、熟悉iPhone SDK及相关开发工具； \n4、熟悉Objective-C/Swift程序设计，了解熟练运用XCode，Interface Builder等开发工具； \n5、逻辑思维能力强，责任感强，工作积极主动，有良好的团队协作意识；工作踏实认真，对移动应用开发行业充满热情，有不断提升自己的学习意识； \n6、已有应用在苹果App Store上线者优先考虑。',


'网络工程师':
'岗位职责：\n1、负责华为/华三/思科交换机、路由等相关网络产品督导、调测、升级、割接、网络优化等；\n2、及时输出完整的工程交付文挡，配合客户工程验收；\n3、技术服务，负责解答客户咨询的技术问题，及时处理现场设备故障；\n4、具有3年以上的项目实施经验，负责项目售前售后支持，包括技术交流、需求引导、方案编写、标书制作、讲标、测试实施、售后技术支持等；\n5、及时响应、处理客户的突发故障。任职要求：\n1、 本科及以上学历，计算机相关专业；\n2、 3年以上系统网络集成项目实施经验，及1年以上投标方案编写经验；\n3、 主流网络设备厂商相关认证者优先考虑，如CCIE、H3CIE等；\n4、 熟悉信息和通信网络知识，掌握主流网络设备配置与维护。如 CISCO、华为、H3C；\n5、 掌握信息安全技术，掌握主流防火墙、入侵检测、上网行为等安全设备的配置及维护。如天融信、深信服、CISCO、H3C等；\n6、 了解数据存储知识，掌握主流存储设备、备份软件的应用和维护；\n7、 了解服务器相关软硬件知识，掌握主流服务器的软硬件安装',

'运维工程师':
'岗位职责：\n1、可配合团队完成相关的项目程序工作\n2、熟练运用Linux系统，能完成服务器巡检和问题排查\n3、负责业务系统的日常技术运营维护、事务处理；\n4、 负责测试系统需求和BUG，确保功能正常上线；\n5、 负责指导客户熟练使用系统，解答客户使用系统过程中遇到的问题；\n6、 针对新产品、新业务的规则以及监管要求的变化进行系统的业务咨询；\n7、完成客户现场临时指派的任务；\n任职要求：\n1、熟悉JAVA程序测试和代码调试，BUG修改，JS/VB脚本；\n2、熟练使用常用办公软件（WORD，PPT，EXCEL等）；\n3、掌握DB2数据库以及WebSphere应用服务器的操作；\n4、具有良好的沟通能力和服务精神；',

'系统工程师':
'岗位职责：\n1、以CRM系统或客户管理系统为主，负责系统的更新、迭代和优化\n2、负责相关模块性能分析及改进，保证系统性能和稳定性，\n3、持续改进软件系统架构、核心算法或者核心技术等，保证系统高性能、高可用性和高可扩展性\n4、新技术预研，协助完成方案选型和设计 \n5、同时负责少儿编程线上学习平台的Web后端研发和建设；任职要求：\n1、统招本科以上学历，计算机或计算机相关专业，3-5年及以上工作经验，有教育行业研发经验优先；\n2、精通Java语言及第二语言，如python、golang等；对Java面向对象软件结构有深入理解以及很强的应用能力，能够熟练应用 JavaScript等WEB开发技术，熟练掌握Spring和Mybatis等主流的开发框架 能够熟练应用mysql ，有一定的数据库设计与调优能力 \n3、熟练使用Unix、Linux，能进行shell编程经验 学习能力强，拥有优秀的逻辑思维能力；\n4、自我管理能力强，有良好的时间意识；有较好的需求理解和沟通能力，具备团队合作精神及团队领导能力；',


'项目助理':
'岗位职责：\n1、参与搭建公司项目管理体系； \n2、设计项目管理体系中的模版和工具，撰写项目管理文档；\n3、跟进和监控各项目组工作进度，并做出提示；\n4、对各项目组对管理规范和流程的执行进行监督和指导；\n5、辅助PMO对公司各项目组进行阶段性审查，产出项目评价报告。\n任职要求：\n1、统招本科及以上学历，管理类相关专业优先； \n2、一年以上组织和管理相关工作经验，从事过项目管理或PMO工作者优先；\n3、良好的计划、组织、沟通、培训、管理能力；\n4、良好的文档能力，熟练掌握Word、Excel、PPT等办公软件；\n5、持有PMP、PRINCE\n2、ACP等项目管理认证者优先。',

'项目经理':
'岗位职责：\n1、配合产品经理明确项目目标和优先级；负责各个项目的计划制定、进度推进，确保项目按计划完成；\n2、发现项目执行过程中的问题并及时解决，识别风险、提前预警并制定应对措施；针对问题进行分析与判断，持续过程改进；\n3、协调各个维度资源、合理调配，建立资源日历，追踪资源使用情况，针对资源的冲突进行提前预警并解决相关问题；\n4、制定并推广项目管理流程，培养各个职能部门的项目管理意识；\n5、负责项目团队的团队建设、促进沟通团队沟通，提升团队凝聚力；\n任职要求：\n1、3-5年项目管理经验，熟悉软件项目开发的各个过程；\n2、熟悉项目管理知识体系，具有较为规范的项目管理实战经验与技能；\n3、具有优秀的整合能力、沟通能力与组织协调能力，具备较好的发现和解决问题的能力，学习能力强； \n4、熟练使用JIRA、confluence、project等项目管理工具；具有PMP等项目管理资格认证；',


'测试经理':
'岗位职责:\n1、负责建立软件自动化测试框架，制定测试流程规范和计划。\n2、负责设计测试用例和测试数据，实施测试工作，保证软件质量。\n3、负责跟踪分析测试情况解决测试过程遇到的问题，建立、维护测试文档和报告。 \n4、根据公司发展完善测试团队建设，提高测试技术和业务能力。\n任职要求:\n1、5年以上互联网产品测试经验，有移动客户端、Web端等产品测试经验。\n2、熟悉测试理论，精通测试相关工具，丰富实践经验，具有搭建测试环境，编写测试脚本能力。 \n3、具有高度责任感，做事认真细致，精益求精，严于律己。\n4、良好的组织领导和沟通能力，能够培训和指导测试人员。',

'软件测试工程师':
'岗位职责：\n1、对公司web产品/app产品的功能测试、接口测试、兼容性测试；\n2、准确地定位并跟踪问题，推动问题并及时合理的解决问题；\n3、理解项目需求，设计测试方案、计划，编写测试用例，执行测试，生成测试报告。\n任职要求：\n1、计算机相关专业全日制本科及以上学历；\n2、3年以上测试经验，负责过移动端、H5测试\n3、熟悉软件测试流程，熟悉敏捷开发流程，对 BUG 成因有一定分析能力；  \n4、熟练掌握 SQL 语言，熟练使用 Mysql数据库，熟悉常用的测试工具；\n5、沟通能力强，具备独立的思考能力和解决问题的能力，善于创新性思维；\n6、工作认真负责，对质量和风险敏感，对质量有高标准；\n7、熟悉接口测试，有 Jmeter / SoapUI /testNg 之一等实际经验加分',

'测试开发工程师':
'岗位职责：\n1、负责VMware自动化测试效率平台开发及维护，包括但不仅限于测试环境平台、持续集成平台等等（容器技术）；\n2、提升业务工程效率，进行流程管理，环境管理，持续集成系统的建设，推动业务持续集成及敏捷应用落地；\n3、对主流自动化测试技术有应用，包括开源自动化工具，自动化测试平台等，能推进业务应用及提供专业指导； \n4、有很强的探索意识，具备一定的开发架构能力；\n任职要求：\n1、2年以上Java/Python/C++/开发经验，扎实的代码基础；\n2、熟悉WEB端测试，至少掌握或应用过一种自动测试工具(Selenium / JMeter / LoadRunner)；\n3、熟悉Linux操作系统，了解基本的Shell语句；\n4、良好的研发管理思维，能够基于测试驱动开发，工程效率维度考虑问题，有很强的分析能力和定位问题的能力；\n5、熟悉开源项目开发过程及相关代码管理工具，热爱开源技术 \n6、英语四级以上读写熟练，口语好优先',

'自动化测试工程师':
'岗位职责：\n1、负责搭建后台接口自动化框架以及接口测试；\n2、负责客户端UI自动化测试，保证可靠兼容性；\n3、熟悉服务端性能测试；\n4、利用自动化测试提升整体研发效率及测试质量。\n任职要求\n1、精通python语言，熟悉sql ，有接口自动化项目经验；\n2、熟悉Linux操作系统，有性能测试项目经验；\n3、熟悉持续化集成，会使用多种测试工具 ，如appium，JMeter等；\n4、具有较强的业务分析能力，较好的沟通表达和综合协调能力。',

'游戏测试工程师':
'岗位职责：\n1、参与需求评审，制定测试方案、编写测试用例并执行；\n2、对测试中发现的问题进行详细分析和准确定位，推动缺陷的解决；\n3、完成产品的集成测试与系统测试；\n4、测试技术/工具/系统的研究和应用，测试流程的规范和优化。\n任职要求：\n1、本科以上学历，具有一年以上移动端测试经验； \n2、熟悉测试流程及测试方法；\n3、精通功能测试用例设计方法，深入理解移动端测试点；\n4、熟悉数据库基本操作，熟悉Charles、Postman 等接口测试工具；\n5、有较强的学习能力强和执行能力，有较强的逻辑推理能力和严谨工作作风，善于总结思考；\n6、有责任心，团队精神，抗能够承担高强度的工作压力。'
}



position_keywords = {
    "图像算法工程师":["图像"],
    "算法工程师":["算法"],
    "机器学习算法工程师":["机器学习"],
    '深度学习算法工程师':["深度学习"],
    '视觉设计师':['视觉'],
    'NLP算法工程师':['NLP','nlp'],

    '.net开发工程师':['\.net','\.NET','\.Net'],
    'C#开发工程师':['c#','C#'],
    'C++开发工程师':['C\+\+','c\+\+'],
    '全栈工程师':["全栈"],
    '后端开发工程师':['后端'],
    'Golang开发工程师':["Golang","golang"],
    'Java开发工程师':["java",'Java'],
    'PHP开发工程师':['php',"PHP",'Php'],
    'Python开发工程师':["python",'Python','PYTHON'],
    '数据挖掘工程师':['数据挖掘'],
    '推荐算法工程师':['推荐算法'],

    'DBA':["DBA"],                  #添加
    'ETL工程师':["ETL",'etl','Etl'],
    '大数据开发工程师':["大数据"],
    '数据仓库工程师':["数据仓库"],

    'BI工程师':["BI","bi","Bi"],
    '售前工程师':["售前"],
    '实施工程师':["实施"],
    '售后服务专员':["售后"],

    '前端开发工程师':["前端",'web','WEB',"Web"],

    '硬件工程师':['硬件'],
    '嵌入式软件工程师':['嵌入式'],#删除嵌入式开发、自动化测试

    '安全工程师':['安全工程师'],
    '技术总监':['技术总监'],
    '技术经理':['技术经理'],
    '架构师':['架构师'],

    'Android开发工程师':['Android','android'],
    'iOS开发工程师':['ios', 'iOS','IOS'],

    '网络工程师':['网络'],
    '运维工程师':['运维'],
    '系统工程师':['系统工程师'],#删掉运维开发工程师

    '项目助理':['项目助理'],
    '项目经理':['项目经理'],

    '测试经理':['测试经理'],
    '软件测试工程师':['软件测试'],
    '测试开发工程师':['测试开发'],
    '游戏测试工程师':['游戏测试'], # 变为游戏测试工程师
    '自动化测试工程师': ['自动化测试']
}
